Repository: CofficLab/GitOK
Catalog: Packages/PluginRootView/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: Add
zh_hans: 添加
zh_hk: 新增

source: Add an existing Git repository, or clone a new one to get started.
zh_hans: 添加现有 Git 仓库，或克隆一个新仓库以开始使用。
zh_hk: 新增現有 Git 儲存庫，或複製一個新儲存庫以開始使用。

source: Add Project
zh_hans: 添加项目
zh_hk: 新增專案

source: Branch, worktree, and activity indicators sit at the bottom.
zh_hans: 分支、工作树与活动指示器位于底部。
zh_hk: 分支、工作樹與活動指示器位於底部。

source: Choose a Git repository folder to add to GitOK
zh_hans: 选择一个 Git 仓库文件夹添加到 GitOK
zh_hk: 選擇一個 Git 儲存庫資料夾加入 GitOK

source: Clone Repository
zh_hans: 克隆仓库
zh_hk: 複製儲存庫

source: Commits, diffs, worktrees, and settings render in the main pane.
zh_hans: 提交、差异、工作树与设置渲染在主面板。
zh_hk: 提交、差異、工作樹與設置渲染在主面板。

source: Compose the window
zh_hans: 组装窗口
zh_hk: 組裝窗口

source: Content
zh_hans: 内容
zh_hk: 內容

source: Content Area
zh_hans: 内容区
zh_hk: 內容區

source: Core Capabilities
zh_hans: 核心能力
zh_hk: 核心能力

source: core regions
zh_hans: 核心区域
zh_hk: 核心區域

source: Each feature registers its toolbar, sidebar, or content views.
zh_hans: 每个功能注册自己的工具栏、侧边栏或内容视图。
zh_hk: 每個功能註冊自己的工具欄、側邊欄或內容視圖。

source: How It Works
zh_hans: 工作原理
zh_hk: 工作原理

source: Opening a project re-renders the workspace around it.
zh_hans: 打开项目即围绕它重新渲染工作区。
zh_hk: 打開項目即圍繞它重新渲染工作區。

source: Project list, repository tree, and navigation live on the left.
zh_hans: 项目列表、仓库树与导航位于左侧。
zh_hk: 項目列表、倉庫樹與導航位於左側。

source: Register regions
zh_hans: 注册区域
zh_hk: 註冊區域

source: Sidebar
zh_hans: 侧边栏
zh_hk: 側邊欄

source: Status Bar
zh_hans: 状态栏
zh_hk: 狀態欄

source: Switch projects
zh_hans: 切换项目
zh_hk: 切換項目

source: The root view assembles all registered regions into one layout.
zh_hans: 根视图把所有注册区域组装为一个布局。
zh_hk: 根視圖把所有註冊區域組裝為一個佈局。

source: The window that hosts the entire GitOK workspace.
zh_hans: 承载整个 GitOK 工作区的窗口。
zh_hk: 承載整個 GitOK 工作區的窗口。

source: Welcome to GitOK
zh_hans: 欢迎使用 GitOK
zh_hk: 歡迎使用 GitOK

source: window
zh_hans: 窗口
zh_hk: 窗口

source: Cloning repository
zh_hans: 正在克隆仓库

source: GitOK is cloning this repository in the background.
zh_hans: GitOK 正在后台克隆此仓库。

source: Project Not Found
zh_hans: 未找到项目

source: Project Path
zh_hans: 项目路径

source: Remove from Project List
zh_hans: 从项目列表中移除

source: The project directory no longer exists on disk.
zh_hans: 项目目录已不存在于磁盘上。

source: You can remove this project from the project list, or move the directory back to the original location.
zh_hans: 您可以从项目列表中移除此项目，或将目录移回原始位置。
